import React from 'react';
import { ScrollView, Text, TouchableOpacity, StyleSheet } from 'react-native';

const PrivacyProtocol = () => {
  return (
    <ScrollView style={styles.userProtocolContainer}>
      <Text style={styles.userProtocolText}>隐私政策
本隐私政策描述了广州宠觅科技有限公司 (下文简称“广州宠觅科技”或“本公司”或“我们”) ，如何利用多种数字方式收集和使用所有通过其平台提交的用户信息和/或数据，及其产品采集的用户信息和/或数据，最近更新日期: 2023年08月09日
广州宠觅科技将确保遵守严格的安全保密标准，不经用户同意，广州宠觅科技不会泄露任何个人信息和/或数据资料，下文第3点所列“第三方授权”除外。
本公司强烈建议用户仔细阅读本隐私政策以便了解本公司对于用户在广州宠觅科技平台上提供的个人信息/或数据及使用广州宠觅科技产品上报的信息和/或数据的相关政策和实际应用。本隐私政策适用于注册和非注册用户，并且当我们认为必要时可不定期更新、修订、更改相关条款内容。更改后的版本，一经发布立即生效。如果您对本隐私政策有任何疑问或顾虑请联系广州宠觅科技进行咨询（发送邮件至邮箱：xxx.com或者添加微信：xxx）。如果您对本隐私政策的条款存在异议，请立即停止使用广州宠觅科技的服务和产品;如果您继续使用广州宠觅科技的服务和产品，表示您接受本隐私政策所列各项条款。本隐私政策构成《使用条款》的一部分并受其约束。
广州宠觅科技有权在任何时间修改本隐私政策，并于公布之时起生效。

一、收集信息和/或数据 
(1) 广州宠觅科技会收集并存储任何用户提供给我们或允许我们使用的信息和/或数据。该等信息和/或数据可能包括但不限于，用户使用广州宠觅科技产品所提交的姓名、肖像、性别、生日、身高、体重、手机号码、电子邮箱地址、实体地址、联系人信息、社交媒体信息、有效身份证件号码和家庭成员、宠物资料等个人资料，以及银行卡和支付平台等相关资料 (如必要)。
(2) 广州宠觅科技会自动收集并存储用户与我们进行互动或使用我们的服务和产品时产生的信息和/或数据。用户使用广州宠觅科技服务和产品可能被采集的，包括但不限于硬件信息、系统类型、设备识别符、IP地址MAC地址、地理 (GPS) 位置、活动数据、运动数据行为偏好、宠物日常数据、文字、图片、影像、声音等信息和/或数据。
(3) 广州宠觅科技会与其他网站、媒体、平台、渠道移动应用以及其他商品或服务 (“第三方”) 链接或合作。所有通过广州宠觅科技平台和产品与第三方 (微信、淘宝、京东等) 进行互动的信息和/或数据都可能被收集。我们可能将您通过广州宠觅科技平台提供给我们的或我们收集的信息和/或数据进行整合，可能包括但不限于，来自广州宠觅科技店铺、渠道、活动、产品和应用程序的信息和/或数据。此类信息和/或数据将会被视为个人资料，只要此类资料保持关联的状态。
(4) 我们会集成高德地图(SDK类型，如定位] SDK用于实现[如定位及地图展示等]的功能。该SDK主体为: 高德软件有限公司; 收集的个人信息包含: 位置信息 (经纬度、精确位置、粗略位置)(通过IP地址、GNSS信息、WiFi状态、WiFi参数、WiF列表、基站信息、信号强度的信息、蓝牙信息、传感器信息 (矢量、加速度、压力) 、设备信号强度信息获取]、设备标识信息 (IMEI、IDFA、IDFV、AndroidID、MEID、MAC地址、OAID、IMSI、硬件序列号)、当前应用信息 (应用名、应用版本号) 、设备参数及系统信息 (系统属性、设备型号、操作系统)了解此情形中目前涉及的公司、组织和个人，请点击此处（指向：https://lbs.amap.com/pages/privacy/）。
(5) 不同国家/地区可能对特定平台服务有相应年龄限制，请您仔细查阅您所在国家/地区的相关规定。如果您未满18周岁，您声明并保证您已取得您监护人的同意使用广州宠觅科技的服务和产品并同意本隐私政策
二、使用信息和/或数据
广州宠觅科技将确保遵守严格的安全保密标准，合法使用收集并存储的信息和/或数据，您的信息和/或数据可能被使用干:
(1) 为您提供广州宠觅科技的服务和产品。
(2) 改进和维护广州宠觅科技的服务和产品体验，包括但不限于分析用户行为和趋势。
(3) 出于广州宠觅科技的服务、产品和活动以及其他促销目的与您进行沟通。
(4) 根据您的许可，向您提供促销、产品发布活动、问卷调查和其他信息。
(5) 统计信息和/或数据并分析服务和产品使用情况以供本公司或关联公司 (与本公司存在直接或间接控制关系或重大影响关系的企业) 内部使用。

三、第三方授权
一般来说，我们认为必要以维持和改善广州宠觅科技的服务和产品，会将您的信息和/或数据提供给广州宠觅科技及其关联公司内部员工以便为用户提供服务。然而，在下列情况下，我们可能会将您的信息和/或数据传递给第三方:
(1) 在保密的情况下，我们可能会将您的信息和/或数据披露和/或转让予任何本公司授权的第三方供应商或外部供应商，以促进渠道所提供的服务，其中一些公司可能在第三国(即除了您所属国家和中国之外的国家/地区) 您知悉并同意，第三国的数据保护法律可能不符合欧盟《一般数据保护法》。
(2) 我们可能将您的信息传输至广州宠觅科技的服务提供商以便开展我们的业务，当您的信息和/或数据披露和)或转让予广州宠觅科技授权的任何代理人或关联公司，经本公司授权使用该等资料和/或数据。他们仅可访问他们完成其功能所必须的个人信息和/或数据，且不能为其他目的而使用。
(3) 我们可能会根据有管辖权的司法部门的命令、遵照法律要求，为执行我们的政策或为保护我们或其他人的权利、财产和/或安全而披露您的信息和/或数据。我们可能共享您的信息和/或数据以阻止非法使用广州宠觅科技的服务和产品、违反《使用条款》的行为，或针对第三方诉讼进行法律抗辩。
(4) 我们可能与其他帮助我们进行反欺诈或调查的依法设立且依法具有信息、数据收集和调查职权的行政、司法机关共享信息，包括但不限于司法程序、法院命令或渠道上的法律程序，且有必要提供。
(5) 我们通过广州宠觅科技服务和产品所收集的个人信息和/或数据可以在广州宠觅科技及其关联公司之间转移或储存。如果您使用广州宠觅科技的服务和产品，将视为同意并授权广州宠觅科技在上述情况下披露和转载您的个人信息和/或数据。
(6) 您的信息可能作为广州宠觅科技全部或部分资产出售、转让、转移至第三方。如果发生这种情况，我们将通过公示、通知或其他的通信方式通知您。

四、共享信息和/或数据
(1) 当您参与或使用广州宠觅科技特定的服务或活动时，您同意公开分享一些基本的信息，可能包括您的用户名、所在城市和头像图片。
(2) 如果您不同意共享您的信息和/或数据，您可能需要调整您的隐私设置。
(3) 您可以选择将您的信息和/或数据通过广州宠觅科技平台共享至其他平台，但请阅读其他平台的隐私政策，我们对于您共享至其他平台的信息和/或数据的安全性不负任何责任。
(4) 您同意我们出于推广本公司产品的目的可能会使用您公开共享的信息和/或数据。
五、保护信息和/或数据
(1) 保障您的信息和/或数据的安全对我们非常重要，广州宠觅科技致力于确保您的个人信息和/或数据免受未经授权的接触。我们使用多种保护措施，包括加密和验证工具来帮助保护您的信息和/或数据安全。
(2) 尽管我们遵循公认的行业标准保障您的信息和/或数据安全。然而，由于互联网传输和电子存储的特殊性，我们无法保证您提供的信息和/或数据百分之百安全或保密。
(3) 您可以通过关闭特定的信息通讯方式 (如断开网络连接、关闭定位功能等) 中止/终止信息和/或数据的上传，但因此可能导致您无法使用广州宠觅科技的服务和产品，或者我们的一些服务和功能可能无法正常工作。
(4) 请妥善保存您的账户、密码和其他登录信息，请勿随意授权和/或转让他人使用您的账户。
(5) 本公司对在线交易采用第三方支付平台易以促进电子交易的渠道。
(6)您可以通过登录广州宠觅科技的应用程序更改或册除您的部分信息和/或数据资料，但您以前发布的信息可能仍然是公开可见的。
(7) 您对通过您的广州宠觅科技账户而产生的任何后果负责，无论是否经过您的同意。在适用法律允许的最大限度内，广州宠觅科技不对任何或因未经授权使用您账户而导致信息和/或数据泄露的行为及后果负责。
(8) 不论您居住在任何国家/地区，您同意我们将您的信息和/或数据转移、处理和储存在广州宠觅科技的数据库里，并允许广州宠觅科技根据本隐私政策收集并使用信息和/或数据。根据法律规定，您的个人信息和/或数据将会由广州宠觅科技保留到相关服务停用后，直至用户以书面形式要求我们从数据库中删除其个人信息和/或数据或终止其个人在广州宠觅科技应用程序的用户资格。
(9) 注销指引: 若不再使用本APP，可在“我”-“隐私保护”-“注销账号”的路径对所注册账号进行注销

六、条款
您使用我们的服务和产品，以及由此产生的任何争议均受本隐私政策以及《使用条款》的约束，该条款规定了其他关于使用广州宠觅科技服务和产品的规则。
























</Text>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
    userProtocolContainer: {
        flex: 1,
        padding: 10,
        backgroundColor: 'white',
    },
    userProtocolText: {
        marginVertical: 10,
        fontSize: 16,
    },
    backButton: {
        marginTop: 20,
        alignItems: 'center',
        padding: 10,
        backgroundColor: '#ebebeb',
        borderRadius: 5,
    },
    backButtonText: {
        fontSize: 16,
    }
});

export default PrivacyProtocol;