import React from 'react';
import { ScrollView, Text, TouchableOpacity, StyleSheet } from 'react-native';

const UserBehavior = () => {
  return (
    <ScrollView style={styles.userProtocolContainer}>
      <Text style={styles.userProtocolText}>隐私政策
      宠友圈行为规范
珮觅宠物一直致力于为养宠人士创造更科学更美好的养宠环境，为用户提供文明健康、规范有序的网络环境，向社会各界传达爱宠文化。努力将宠友圈打造成一个属于宠物主人及宠物爱好者的优质互动平台，给予用户更多体验上的便利。为了保障用户的合法权益,倡导并树立文明养宠意识，我们坚决打击各类违法违规的内容和行为。
为规范宠友圈的使用行为，明确界定各类违规现象，珮觅宠物依据并贯彻相关法律法规及相关部门的管理政策，形成正式、公开的行为规范及处理准则，期望我们一起创建并维护这个属于宠物爱好者的和谐社区

一、总则
1.为维护宠友圈秩序，更好的保障用户合法权益，珮觅宠物根据现行法律法规及《珮觅宠物软件许可协议及使用条款》，制定《宠友圈行为规范》 （以下简称“本规范”）。
2.用户在宠友圈内不得违反现行法律法规。珮觅宠物将按照相关法律法规、《珮觅宠物软件许可协议及使用条款》及本规范，对违规行为进行处理，并配合有权机关维护其他用户的合法权益。
3.若您对本细则的理解和执行有任何疑惑或争议，可与我们联系（发送邮件至邮箱：xxx.com或者添加微信：xxx），我们将根据有关规则予以解释或处理。

二、使用规范
1.宠友圈内容规范
1.1 侵权或侵犯隐私类内容
1.1.1 主体侵权
1) 擅自使用他人名称、头像，侵害他人名誉权、肖像权等合法权利。
2) 泄露他人隐私。未经用户明确同意，公开他人或其究物信息，包括但不限于身份证号码、照片、手机号、微信号、居住地、宠物信息等涉及个人隐私。
3) 擅自使用他人已经登记注册的企业名称或商标，侵犯他人企业名称专用权及商标专用权。
1.1.2 内容侵权
1) 未经授权发布他人原创内容，侵犯他人知识产权，包括但不限于图片、文章等内容。
2) 捏造事实丑化他人或其宠物，或用侮辱、诽谤等方式损害他人名誉。
3) 未经授权发布企业商业秘密，侵犯企业合法权益
1.2 违背文明养宠及科学养宠观念的内容
传播错误的养宠行为和常识，或引起养宠用户不适的内容，包括但不限于: 以不牵绳为荣、恐吓宠物、虐待宠物等内容。
1.3 恶意引战，破坏友好交流氛围
内容包括但不限于: 辱骂、讽刺他人或其宠物;恶意攀比等行为。
1.4 不按要求发布广告相关内容
1.4.1在图文区或视频区发布广告
1.4.2发布与宠物行业无关的广告
1.4.3重复发布相同的广告内容
同一用户，24小时内不得发布超过3条的广告内容。相同的广告内容，不得连续发布，不得造成刷屏从而影响他人用户体验。
1.4.4发布与珮觅宠物旗下产品及业务重复的广告例如珮觅宠物旗下产品包含宠物定位器，则其他品牌的宠物定位器视为与珮觅宠物产品重复的广告。
1.4.5恶意诋毁产品或企业以商业利益为目的，恶意诋毁同行或某款产品，包括但不限制于: 编造不实信息、扭曲事实、传播谣言等。
1.4.6涉嫌欺诈虚假广告
以骗取钱财为目的的欺诈广告 (例如中奖类信息) ;虚假使用效果的广告;推广销售假冒伪劣商品的广告。
1.4.7非法物品及违法广告类内容
违法广告包括但不限于: 买卖来源不明或捡来的宠物;发票、出售假烟、假币、赃物、走私物品;违法办证等信息。
非法物品包括但不限于: 象牙、虎骨等非法野生动物制品、贩卖毒品、窃听器、军火、人体器官、迷药、国家机密、信用卡套现，办证等。
1.5 危害平台安全内容
1.5.1 发送钓鱼网站等信息，诱使用户上当受骗蒙受损失。
1.5.2 发送病毒、文件、计算机代码或程序，可能对珮觅宠物软件的正常运行造成损害或中断。
1.5.3 使用插件等手段，恶意刷点赞数，对用户体验及公平性造成恶劣影响。
1.6色情及色情擦边类内容
1.6.1散布淫秽、色情内容，包括但不限于招嫖、性伴侣等内容。
1.6.2 发送以色情为目的的情色文字、情色视频、情色漫画等内容，但不限于上述形式。
1.6.3 长期发送色情擦边、性暗示类信息内容，以此来达到吸引用户的目的。
1.7 暴力内容
1.7.1 散播人或宠物被杀、致残以及枪击、刺伤、拷打等受伤情形的真实画面。
1.7.2.出现描绘暴力或虐待儿童、宠物等内容
1.7.3 出现吸食毒品、自虐自残等令人不安的暴力画面内容。
1.7.4无资质销售仿真枪、弓箭、管制刀具、气枪等含有杀伤力枪支武器。
1.7.5出现以鼓励非法或鲁莽使用方式等为目的而描述真实武器的内容。
1.8 赌博类内容
发送组织聚众赌博、出售赌博器具、传授赌博 (千术)技巧、方式、方法等内容。
1.9 涉黑类内容
发送替人复仇、收账等具有黑社会性质的信息;雇佣引诱他人从事恐怖、暴力等活动;拉帮结派，招募成员，对社会秩序构成潜在危害的内容。
1.10 非法物品类内容
包括但不限于买卖发票;出售假烟、假币、赃物、走私物品;违法办证刻章、代办身份证、信用卡、办理手机复制卡等信息;交易人体器官等内容。
1.11不实信息类内容
本规则所称的不实信息，指由用户等主体自行编造、转发、传播的虚构事实、隐瞒真相等信息。包括但不限干:
1.11.1 涉及反对宪法确定的基本原则、社会主义制度危害国家统一、主权和领士完整、泄露国家秘密、危害国家安全或者损害国家荣誉和利益等政治类不实信息。
1.11.2 煽动国家、地区、民族、宗教间仇恨、歧视、误解，损害善良风俗的不实信息。例: XX地方吃狗肉，抵制XX人。
1.11.3 扰乱社会秩序、引起或可能引起公众恐慌的不实信息。
例: 请不要再给狗狗吃XX牌的狗粮了， 请火速通知身边朋友。
1.11.4宣扬邪教和封建迷信的不实信息。
1.11.5与生活常识、公众话题相关的不实信息
1.12诱导他人发布、诱导分享类内容
1.12.1利诱用户发布宠友圈: 指定需发布的内容，并且发布宠友圈后对用户进行奖励。
1.12.3胁迫、煽动用户分享: 用夸张言语来胁迫、引诱用户分享。包括但不限于:“请好心人转发一下”、“养宠必转”等。
1.13 其他涉及违法违规或违反相关规则的内容

2.	商标与商业外观
2.1用户必须遵守商标、版权等知识产权法律法规以及珮觅宠物关于知识产权使用的相关规则。
2.2用户如非商标所有权人或未经授权不得使用他人商标。
2.3 在宠友圈中发布含有他人商标、版权等涉及他人知识产权内容的，珮觅宠物有权要求发布者如实说明，发布者需根据要求提供相关权利证书或授权证明，不按照要求予以说明并提供相关权利证明的，该内容将视为前述的违规内容。
2.4 非珮觅宠物官方帐号，禁止在个人帐号名称、宠友圈输出内容中出现与珮觅宠物已有知识产权内容相同或相似的字样 (如“珮觅宠物”、“Pet Minder+”、“宠觅”、“珮觅”、“佩觅”等) 的字样，或者容易与目前已有珮觅宠物产品设计主题、外观等相混淆的内容。
2.5 任何非珮觅宠物官方运营的账号，不得进行任何误导或暗示其为该珮觅宠物工作人员的行为，或者误导和暗示珮觅宠物以任何形式表示认可其质量、服务或与其存在合作关系。

3.	阶梯式处罚机制与举报申诉机制
珮觅宠物通过主动发现及接受用户举报、投诉发现违规行为，处理形式详见如下:
违规处理包括: 内容处理和账号处理。
内容处理包括: 删除违规宠友圈、删除违规评论、禁止发宠友圈、禁止评论他人宠友圈等。
账号处理包括: 禁止发布宠友圈和评论、禁止添加好友、账号封停等。
3.1阶梯式处罚机制
3.1.1 违规内容
31.1.1一经发现前述违规内容，珮觅宠物将立即删除相应宠友圈。
对于违规发布的账号，我们将视情节对违规用户进行警告、禁言或禁止使用部分或全部功能、帐号封停的处罚。情节较轻者，累计违规三次，将禁言3~7天。屡次违规或情节较重者，将进行1个月以上的禁言或一定期限内账号封停。
3.1.1.2侵权或侵犯隐私类内容
主体侵权: 首次出现此类侵权行为将对
违规内容进行删除处理，并对违规用户进行禁言处理，直至违规用户修改违规信息。屡次违规或情节严重者，珮觅宠物将对违规帐号予以一定期限内封号处理。
内容侵权: 首次出现此类侵权行为将对违规内容进行删除处理，多次出现或情节严重的将对违规帐号予以一定期限内禁言或封号处理。
3.1.1.3违反国家法律法规的其他行为
对于色情及色情擦边类内容、暴力内容、赌博类内容涉黑类内容、非法物品销售类内容，将视违规程度，对违规用户进行相应处罚。 首次出现此类行为将对违规内容进行删除处理，多次出现或情节严重的将对违规帐号予以一定期限内封号处理。
3.2 举报、投诉和申诉机制
3.2.1举报、投诉机制
珮觅宠物用户及其他法律主体如认为宠友圈内存在侵权或违法违规信息或行为，可以分别通过以下途径进行举报或投诉，并提供相关符合法律和珮觅宠物要求的举报或投诉证明材料:
3.2.1.1 举报宠友圈违法违规的内容，可通过点击在相应宠友圈内容内的“...”按钮的举报功能，进行举报;
3.2.1.2 投诉珮觅宠物用户发布的宠友圈涉嫌侵权信息或行为，应通过邮件向珮觅宠物发送侵权证据进行举报;侵权举报: 邮件发送至xxx.com。
3.2.2申诉机制
用户如对处理结果有异议的，可以通过以下途径进行申诉或解封:
3.2.2.1邮件申诉: 将相关资料及证明发送至xxx.com.
3.2.2.2微信客服: 微信搜索并添加客服: xxx

4.	免责声明
4.1宠友圈广告区均由消费者或商家自行发布，用户应当自行判断该广告或推广信息的真实性和可靠性，并位自己的判断行为负责。如因该广告或推广信息进行的购买、交易或因前述内容遭受损失或损害，用户应自行承担，珮觅宠物不予承担责任。
4.2 所有用户发表的宠友圈及评论内容，仅代表用户个人观点，并不表示珮觅宠物赞同其观点或证实其描述，珮觅宠物不承担用户点评引发的任何法律责任。

5.	条款
您使用我们的服务和产品，以及由此产生的任何争议均受本规范政策以及《使用条款》的约束，该条款规定了其他关于使用广州宠觅科技服务和产品的规则。







</Text>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
    userProtocolContainer: {
        flex: 1,
        padding: 10,
        backgroundColor: 'white',
    },
    userProtocolText: {
        marginVertical: 10,
        fontSize: 16,
    },
    backButton: {
        marginTop: 20,
        alignItems: 'center',
        padding: 10,
        backgroundColor: '#ebebeb',
        borderRadius: 5,
    },
    backButtonText: {
        fontSize: 16,
    }
});

export default UserBehavior;